0.57.2119-1/Enums/ККСНГ_НаправленияЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ККСНГ_НаправленияЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

0.57.2119-1/Enums/ККСНГ_СпособыАвторизацииКурьер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ККСНГ_СпособыАвторизацииКурьер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ApiKey</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТокенСбербанка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_ПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_ПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_ЭлектронныеДокументы</xr:Item>
				<xr:Item>Catalog.ККСНГ_Квитанции</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Filename</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MimeType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Квитанции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Квитанции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_ЭлектронныеДокументы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentUuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Direction</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtendedType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NeedReply</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККСНГ_ExtendedDocumentType</Name>
					<Comment>Расширенный тип документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_ExtendedDocumentType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Uuid</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Content</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SignerCode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>46</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_СертификатыКлючейЭлектроннойПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_СертификатыКлючейЭлектроннойПодписи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Begin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>End</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Image</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Inn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ogrn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступаAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодпискиСК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПослеФормированияЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАвторизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДоступаAPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/CommonModules/ККСНГ_ОбъектыИБВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ЭлектронныеДокументы

// Записывает электронный документ в ИБ 
//
// Параметры: 
//	СтруктураОбъекта      - Структура, см. https://confluence.esphere.ru/display/SBER/Document
//	ПрофильЭДООрганизации - Ссылка на справочник ККСНГ_Организации
//  ПараметрыАвторизации  - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
// Возвращаемое значение: 
//	Результат - ссылка, неопределено - ссылка на справочник ККСНГ_ЭлектронныеДокументы
//
Функция ЗаписатьЭД(СтруктураОбъекта, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	// Подготовка структуры ответа
	СтруктураОтвета = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись ЭД (" + Формат(СтруктураОбъекта.Id, "ЧГ=") + ")");
	
	// Обработка объекта записи
	ЭтоНовыйЭД = Ложь;
	ОбъектЭД = ПолучитьОбъектЭД(СтруктураОбъекта.Id, ПрофильЭДООрганизации, ЭтоНовыйЭД);
	
	// Очистка реквизитов и ТЧ
	ОчиститьДанныеОбъекта(ОбъектЭД);
	
	// Заполнение свойств + дополнительные поля и ТЧ
	ЗаполнитьЗначенияСвойств(ОбъектЭД, СтруктураОбъекта);
	
	ОбъектЭД.Description_ = СтруктураОбъекта.Description;	
	Для Каждого DocumentRelation Из СтруктураОбъекта.Relations.DocumentRelation Цикл
		НоваяСтрока = ОбъектЭД.Relations.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, DocumentRelation);
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
	
		Для каждого DocumentSign Из СтруктураОбъекта.DocumentSigns Цикл
			
			НоваяСтрокаТабличнойЧасти = ОбъектЭД.DocumentSigns.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, DocumentSign);
			
			ДанныеСертификата = DocumentSign.SignatureDetails;
			
			СертификатСсылка = ПолучитьСсылкуСертификат(ДанныеСертификата.Thumbprint);
			Если СертификатСсылка.Пустая() Тогда
				РезультатЗаписиСертификата = ЗаписатьСертификат(ДанныеСертификата);
				Если РезультатЗаписиСертификата.Успех Тогда
					СертификатСсылка = РезультатЗаписиСертификата.Результат;
				Иначе
					Возврат СтруктураОтвета;
				КонецЕсли;
			КонецЕсли; 
			
			НоваяСтрокаТабличнойЧасти.Image = Новый ХранилищеЗначения(DocumentSign.Image, Новый СжатиеДанных(9));
			НоваяСтрокаТабличнойЧасти.Сертификат = СертификатСсылка;

		КонецЦикла; 
		
		ОбъектЭД.КодЭДОВладельца = ПрофильЭДООрганизации.КодУчастникаЭДО;
		ОбъектЭД.Организация = ПрофильЭДООрганизации.Организация;
		ОбъектЭД.НаправлениеЭД = ?(ОбъектЭД.КодЭДОВладельца = ОбъектЭД.SellerCode,
												Перечисления.ККСНГ_НаправленияЭД.Исходящий, 
														Перечисления.ККСНГ_НаправленияЭД.Входящий);
														
		ИнициализироватьСвойстваЭДПоМаркировке(ОбъектЭД, ЭтоНовыйЭД, ПараметрыАвторизации);
														
		ККСНГ_ЭлектронныеДокументы.ЗаполнитьДоступныеДействияКурьер(ОбъектЭД);
		
		// Загрузка доп.параметров
		СписокДопПараметров = ОбъектЭД.Properties;
		Если Не ПараметрыАвторизации = Неопределено Тогда
			ЗапросДопПараметрыДокумента = ККСНГ_APIКурьер.v2_DocumentGetProperties(ПараметрыАвторизации, ОбъектЭД.Id);
			Если ЗапросДопПараметрыДокумента.Успех Тогда
				ДопПараметрыДокумента = ЗапросДопПараметрыДокумента.Результат.StringKeyValue;
				Для каждого ДопПараметрДокумента Из ДопПараметрыДокумента Цикл
					ЗаполнитьЗначенияСвойств(СписокДопПараметров.Добавить(), ДопПараметрДокумента);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	

		// Запись и заполнение структуры ответа
		Если ЗаписатьНекийОбъект(ОбъектЭД, , СтруктураОтвета.Журнал) Тогда
			СтруктураОтвета.Результат = ОбъектЭД.Ссылка;
			СтруктураОтвета.Успех = Истина;
		КонецЕсли;	
	
		ЗафиксироватьТранзакцию();				
		
	Исключение
		ОтменитьТранзакцию();
		СтруктураОтвета.Успех = Ложь;
		ТекстОшибки = "Запись ЭД (" + Формат(СтруктураОбъекта.Id, "ЧГ=") + "): " + ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(СтруктураОтвета.Журнал, ТекстОшибки, "RQ-20003");				
	КонецПопытки;			
		
	Возврат СтруктураОтвета; 
	
КонецФункции // ШаблонЗаписиЭДДокумента

// Получает электронный документ как объект
//
// Параметры:
//	Id                    - Идентификатор электронного документа
//  ПрофильЭДООрганизации - ссылка на справочник ККСНГ_Организации
//  ЭтоНовыйЭД            - Булево - создать новый
//
// Возвращаемое значение: 
//	Результат - объект, неопределено - объект справочника ККСНГ_ЭлектронныеДокументы
//
Функция ПолучитьОбъектЭД(Id, ПрофильЭДООрганизации, ЭтоНовыйЭД = Ложь) Экспорт
	
	ОбъектЭД = Неопределено;
	
	СсылкаСуществующего = ПолучитьСсылкуЭД(Id, ПрофильЭДООрганизации);
	ЭтоНовыйЭД = СсылкаСуществующего.Пустая();
	
	Если ЭтоНовыйЭД Тогда
		ОбъектЭД = Справочники.ККСНГ_ЭлектронныеДокументы.СоздатьЭлемент();
	Иначе
		ОбъектЭД = СсылкаСуществующего.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ОбъектЭД;
	
КонецФункции //ПолучитьОбъектЭД

// Получает ссылку на электронный документ
//	Id - Идентификатор электронного документа
//  ПрофильЭДООрганизации - ссылка на справочник ККСНГ_Организации
//
// Параметры:
//
// Возвращаемое значение: 
//	Результат - ссылка, пустаяссылка - ссылка на справочник ККСНГ_ЭлектронныеДокументы
//
Функция ПолучитьСсылкуЭД(Id, ПрофильЭДООрганизации) Экспорт
	
	СсылкаЭД = Справочники.ККСНГ_ЭлектронныеДокументы.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументы.Id = &Id
	|	И ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца = &КодЭДОВладельца");
	Запрос.УстановитьПараметр("Id", Id);
	Запрос.УстановитьПараметр("КодЭДОВладельца", ПрофильЭДООрганизации.КодУчастникаЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		СсылкаЭД = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат СсылкаЭД;
	
КонецФункции // ПолучитьСсылкуЭД

// Изменяет объент электронного документа в соответствии с ожидаемым событием
//	Id - Идентификатор электронного документа
//  ПрофильЭДООрганизации - ссылка на справочник ККСНГ_Организации
//  Событие - структура DocumentEvent см. https://confluence.esphere.ru/display/SBER/DocumentEvent
//
// Параметры:
//
// Возвращаемое значение: 
//	Результат - ссылка, пустаяссылка - ссылка на справочник ККСНГ_ЭлектронныеДокументы
//
Функция ОтразитьИзмененияВОбъектеЭД(ИдДокумента, ПрофильЭДООрганизации, Событие) Экспорт

	СсылкаЭД = ПолучитьСсылкуЭД(ИдДокумента, ПрофильЭДООрганизации);
	Если СсылкаЭД <> Справочники.ККСНГ_ЭлектронныеДокументы.ПустаяСсылка() Тогда
		
		// Варианты событий
		ИмяСобытия = Событие.EventType;
		
		Если ИмяСобытия = "Revoked" Тогда // документ был отозван
			
			ОбъектЭД = СсылкаЭД.ПолучитьОбъект();
			ОбъектЭД.Status = "Revoked";
			ОбъектЭД.Actions = "";
			//ОбъектЭД.IsDocflowCompleted = Истина;
			RevokeReason = "Причину отзыва смотрите в истории обработки";
			ОбъектЭД.StatusName = "Документ отозван";
			ОбъектЭД.StatusChanged = Событие.Date;
			ОбъектЭД.Записать();
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат СсылкаЭД;
	
КонецФункции	

#КонецОбласти

#Область СвязиЭлектронныхДокументов

// Добавляет записи о связанных с электронным документом документах 1С в регистр сведений
//
// Параметры:
//	ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныеДокументы, Строка - ссылка или уникальный идентификатор электронного документ
//	Документ1С - ДокументСсылка, Строка - ссылка или уникальный идентификатор связанного документа 1С
//	Дата - Дата - дата формирования связи
//	СпособОтправки - ПеречислениеСсылка.ККСНГ_ПМ_СпособыОтправки - способ отправки электронного документа
//
// Возвращаемое значение:
//   Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ЗаписатьСвязьЭлектронногоДокумента(ЭлектронныйДокумент, Документ1С, Дата = Неопределено, СпособОтправки = Неопределено) Экспорт

	СвязанныеДокументы = Новый Массив;
	СвязанныеДокументы.Добавить(Новый Структура("ДокументСсылка, Дата, СпособОтправки", Документ1С, Дата, СпособОтправки));
	
	Возврат ЗаписатьСвязиЭлектронногоДокумента(ЭлектронныйДокумент, СвязанныеДокументы);

КонецФункции

// Добавляет записи о связанных с электронным документом документах 1С в регистр сведений
//
// Параметры:
//	ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныеДокументы, Строка - ссылка или уникальный идентификатор электронного документ
//	СвязанныеДокументы - Массив - массив структур данных связанных документов 1С со свойствами:	
//		* Документ1С - ДокументСсылка, Строка - ссылка или уникальный идентификатор связанного документа 1С
//		* Дата - Дата - Дата формирования связи
//		* СпособОтправки - ПеречислениеСсылка.ККСНГ_ПМ_СпособыОтправки - Способ отправки электронного документа
//
// Возвращаемое значение:
//   Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ЗаписатьСвязиЭлектронногоДокумента(ЭлектронныйДокумент, СвязанныеДокументы) Экспорт

	Перем ЭлектронныйДокументСтрокой, СвязанныйДокумент, ТипСвязанногоДокумента, Дата, СпособОтправки, ДокументСсылка;
	Перем НаборЗаписей, ТаблицаЗаписей, СтрокаЗаписи;
	
	ИмяГруппы = "Записи связей электронного документа " + Строка(ЭлектронныйДокумент);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ИмяГруппы);
	
	Если НЕ ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбъектМетаданныхЕстьВКонфигурации("РегистрСведений", "ККСНГ_СвязанныеДокументы") Тогда
		СобытиеОшибки = "Ошибка записи связанных документов";
		ОписаниеОшибки = "Не обнаружена таблица связанных документов";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, "DLW-00001", ОписаниеОшибки);
		Возврат Ответ;	
	КонецЕсли;	
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		ЭлектронныйДокументСтрокой = XMLСтрока(ЭлектронныйДокумент);
	ИначеЕсли ТипЗнч(ЭлектронныйДокумент) = Тип("Строка") Тогда
		ЭлектронныйДокументСтрокой = ЭлектронныйДокумент;	
	Иначе
		СобытиеОшибки = "Ошибка записи связанных документов";
		ОписаниеОшибки = "Некорретный тип параметра электронного документа";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, "DLW-00002", ОписаниеОшибки);
		Возврат Ответ;
	КонецЕсли;
			
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных();
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ККСНГ_СвязанныеДокументы");
		ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокументСтрокой);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
	
		НаборЗаписей = РегистрыСведений["ККСНГ_СвязанныеДокументы"].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокументСтрокой);
		НаборЗаписей.Прочитать();
		
		ТаблицаЗаписей = НаборЗаписей.Выгрузить();
		
		Для каждого ДанныеДокумента Из СвязанныеДокументы Цикл
			
			Дата = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "Дата");
			СпособОтправки = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "СпособОтправки");
			ДокументСсылка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "ДокументСсылка");
			
			Если Метаданные.РегистрыСведений["ККСНГ_СвязанныеДокументы"].Ресурсы.СвязанныйДокумент.Тип.СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
				СвязанныйДокумент = ДокументСсылка;
			Иначе
				СвязанныйДокумент = XMLСтрока(ДокументСсылка);
			КонецЕсли;
			
			// TODO Переделать
			ТипСвязанногоДокумента = ОбщегоНазначения.ВидОбъектаПоСсылке(ДокументСсылка) + "Ссылка." + ДокументСсылка.Метаданные().Имя;
			
			СтрокаЗаписи = ТаблицаЗаписей.Найти(СвязанныйДокумент, "СвязанныйДокумент");
			
			Если СтрокаЗаписи = Неопределено Тогда
				СтрокаЗаписи = ТаблицаЗаписей.Добавить();
				СтрокаЗаписи.ЭлектронныйДокумент = ЭлектронныйДокументСтрокой;
				СтрокаЗаписи.СвязанныйДокумент = СвязанныйДокумент;
				СтрокаЗаписи.ТипСвязанногоДокумента = ТипСвязанногоДокумента;
			КонецЕсли; 
						
			Если Дата = Неопределено Тогда
				СтрокаЗаписи.Дата = ТекущаяДатаСеанса();
			Иначе
				СтрокаЗаписи.Дата = Дата;
			КонецЕсли;
			
			Если СпособОтправки <> Неопределено Тогда
				СтрокаЗаписи.СпособОтправки = СпособОтправки;
			КонецЕсли;
			
		КонецЦикла;	
		
		УстановитьКлючиСтрокСвязанныхДокументов(ТаблицаЗаписей);
		
		НаборЗаписей.Загрузить(ТаблицаЗаписей);
		НаборЗаписей.Записать();
		
		Ответ.Успех = Истина;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СобытиеОшибки = "Ошибка записи связанных документов";
		ОписаниеОшибки = ОписаниеОшибки();
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, "DLW-00003", ОписаниеОшибки);
				                                                                                
	КонецПопытки;	
	
	Возврат Ответ;

КонецФункции

// Удаляет записи связанных документов электронного документа
//
// Параметры:
//	ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныеДокументы, Строка - ссылка или уникальный идентификатор электронного документ
//	КлючСтроки - Число, Неопределено - ключ строки связи
//
// Возвращаемое значение:
//   Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//
Функция УдалитьСвязиЭлектронногоДокумента(ЭлектронныйДокумент, КлючСтроки = Неопределено) Экспорт

	Перем ЭлектронныйДокументСтрокой;
	Перем НаборЗаписей, ТаблицаЗаписей, СтрокаКУдалению;
	
	ИмяГруппы = "Удаление связей электронного документа " + Строка(ЭлектронныйДокумент);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ИмяГруппы);
	
	Если НЕ ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбъектМетаданныхЕстьВКонфигурации("РегистрСведений", "ККСНГ_СвязанныеДокументы") Тогда
		СобытиеОшибки = "Ошибка удаления связей электронного документа";
		ОписаниеОшибки = "Не обнаружена таблица связанных документов";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, "DLD-00001", ОписаниеОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		ЭлектронныйДокументСтрокой = XMLСтрока(ЭлектронныйДокумент);
	ИначеЕсли ТипЗнч(ЭлектронныйДокумент) = Тип("Строка") Тогда
		ЭлектронныйДокументСтрокой = ЭлектронныйДокумент;	
	Иначе
		СобытиеОшибки = "Ошибка удаления связей электронного документа";
		ОписаниеОшибки = "Некорретный тип параметра электронного документа";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, "DLD-00002", ОписаниеОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных();
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ККСНГ_СвязанныеДокументы");
		ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокументСтрокой);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений["ККСНГ_СвязанныеДокументы"].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокументСтрокой);

		Если КлючСтроки <> Неопределено Тогда
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 1
				И НаборЗаписей[0].КлючСтроки = КлючСтроки Тогда
				НаборЗаписей.Очистить();
			ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
				ВызватьИсключение "Не найдена запись с ключом " + XMLСтрока(КлючСтроки);	
			Иначе	
				ТаблицаЗаписей = НаборЗаписей.Выгрузить();
					
				СтрокаКУдалению = ТаблицаЗаписей.Найти(КлючСтроки, "КлючСтроки");
				Если СтрокаКУдалению = Неопределено Тогда
					ВызватьИсключение "Не найдена запись с ключом " + XMLСтрока(КлючСтроки);
				КонецЕсли;
				
				ТаблицаЗаписей.Удалить(СтрокаКУдалению);
				
				УстановитьКлючиСтрокСвязанныхДокументов(ТаблицаЗаписей);
				
				НаборЗаписей.Загрузить(ТаблицаЗаписей);
			КонецЕсли;
			
		КонецЕсли;
		
		НаборЗаписей.Записать();
		Ответ.Успех = Истина;
			
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		СобытиеОшибки = "Ошибка удаления связей электронного документа";
		ОписаниеОшибки = ОписаниеОшибки();
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, "DLD-00003", ОписаниеОшибки);

	КонецПопытки;
	
	Возврат Ответ;
		
КонецФункции

// Возвращает ссылку на связанный объект 1С для электронного документа
//
// Параметры:
//	ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныеДокументы, Строка - ссылка или уникальный идентификатор электронного документ
//	УИДСвязанногоОбъекта - Строка - уникальный идентификатор связанного объекта 1С
//
// Возвращаемое значение:
//   ЛюбаяСсылка, Неопределено - ссылка на объект 1С
//
Функция СсылкаНаСвязанныйДокументПоИдентификатору(ЭлектронныйДокумент, УИДСвязанногоОбъекта) Экспорт
	
	Перем СсылкаНаСвязанныйДокумент;
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		ЭлектронныйДокументСтрокой = XMLСтрока(ЭлектронныйДокумент);
	ИначеЕсли ТипЗнч(ЭлектронныйДокумент) = Тип("Строка") Тогда
		ЭлектронныйДокументСтрокой = ЭлектронныйДокумент;	
	Иначе
		Возврат СсылкаНаСвязанныйДокумент;
	КонецЕсли;
	
	Запрос = Новый Запрос;                                                                                                          
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 
	|	ККСНГ_СвязанныеДокументы.ТипСвязанногоДокумента,
	|	ККСНГ_СвязанныеДокументы.СвязанныйДокумент
	|ИЗ 
	|	РегистрСведений.ККСНГ_СвязанныеДокументы КАК ККСНГ_СвязанныеДокументы
	|ГДЕ 
	|	ККСНГ_СвязанныеДокументы.ЭлектронныйДокумент = &ЭлектронныйДокумент
	|	И ККСНГ_СвязанныеДокументы.СвязанныйДокумент = &СвязанныйДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ККСНГ_СвязанныеДокументы.Дата";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокументСтрокой);
	Запрос.УстановитьПараметр("СвязанныйДокумент", УИДСвязанногоОбъекта);
	
	ВыборкаДокумента = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДокумента.Следующий() 
		И НЕ ПустаяСтрока(ВыборкаДокумента.ТипСвязанногоДокумента) Тогда
		СсылкаНаСвязанныйДокумент = РегистрыСведений["ККСНГ_СвязанныеДокументы"].СсылкаНаСвязанныйДокумент(
											УИДСвязанногоОбъекта, ВыборкаДокумента.ТипСвязанногоДокумента);
	КонецЕсли;
	
	Возврат СсылкаНаСвязанныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ПрисоединенныеФайлы

// Записывает присоединенный файл в ИБ 
//
// Параметры: 
//	СтруктураОбъекта - структура, см. https://confluence.esphere.ru/display/SBER/Attachment
//	Владелец - ссылка на владельца возможные варианты: ККСНГ_ЭлектронныеДокументы, ККСНГ_Квитанции
//
// Возвращаемое значение: 
//	Результат - ссылка, неопределено - ссылка на справочник ККСНГ_ПрисоединенныеФайлы
//
Функция ЗаписатьПрисоединенныйФайл(СтруктураОбъекта, Владелец) Экспорт
	
	// Подготовка структуры ответа
	СтруктураОтвета = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись присоединенного файла " + Владелец.Метаданные().Имя);
	
	// Для контента документа или квитанции ID ВСЕГДА = 0!
	// Если в структуре отсутствет поле ID, то ID=0
	Id = ?(СтруктураОбъекта.Свойство("Id", Id), Id, 0);
	
	// Обработка объекта записи
	ОбъектПрисоединенныйФайл = ПолучитьОбъектПрисоединенныйФайл(Id, Владелец);
	
	// Очистка реквизитов и ТЧ
	ОчиститьДанныеОбъекта(ОбъектПрисоединенныйФайл);
	
	// Заполнение свойств + дополнительные поля и ТЧ
	ЗаполнитьЗначенияСвойств(ОбъектПрисоединенныйФайл, СтруктураОбъекта);
	
	ОбъектПрисоединенныйФайл.Владелец = Владелец;
	ОбъектПрисоединенныйФайл.Наименование = СтруктураОбъекта.Filename;
	ОбъектПрисоединенныйФайл.Content = Новый ХранилищеЗначения(СтруктураОбъекта.Content, Новый СжатиеДанных(9));
	
	// Запись и заполнение структуры ответа
	Если ЗаписатьНекийОбъект(ОбъектПрисоединенныйФайл, , СтруктураОтвета.Журнал) Тогда
		СтруктураОтвета.Результат = ОбъектПрисоединенныйФайл.Ссылка;
		СтруктураОтвета.Успех = Истина;
	КонецЕсли;	
	
	Возврат СтруктураОтвета; 
	
КонецФункции

// Получает присоединенный файл как объект
//
// Параметры:
//	Id - Идентификатор присоединенного файла 
//		 *Для контента документа или квитанции ID ВСЕГДА = 0 !
//	Владелец - ссылка на владельца возможные варианты: ККСНГ_ЭлектронныеДокументы, ККСНГ_Квитанции
//
// Возвращаемое значение: 
//	Результат - объект, неопределено - объект справочника ККСНГ_ЭлектронныеДокументы
//
Функция ПолучитьОбъектПрисоединенныйФайл(Id, Владелец) Экспорт
	
	ОбъектПрисоединенныйФайл = Неопределено;
	
	СсылкаСуществующего = ПолучитьСсылкуПрисоединенныйФайл(Id, Владелец);
	
	Если СсылкаСуществующего.Пустая() Тогда
		ОбъектПрисоединенныйФайл = Справочники.ККСНГ_ПрисоединенныеФайлы.СоздатьЭлемент();
	Иначе
		ОбъектПрисоединенныйФайл = СсылкаСуществующего.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ОбъектПрисоединенныйФайл;
	
КонецФункции

// Получает ссылку на присоединенный файл
//	Id - Идентификатор присоединенного файла
//	Владелец - ссылка на владельца возможные варианты: ККСНГ_ЭлектронныеДокументы, ККСНГ_Квитанции
//
// Параметры:
//
// Возвращаемое значение: 
//	Результат - ссылка, пустаяссылка - ссылка на справочник ККСНГ_ПрисоединенныеФайлы
//
Функция ПолучитьСсылкуПрисоединенныйФайл(Id, Владелец) Экспорт
	
	Возврат Справочники.ККСНГ_ПрисоединенныеФайлы.НайтиПоРеквизиту("Id", Id, , Владелец);
	
КонецФункции

// Получает данные хранилища значений из справочника
//
// Параметры:
//	ФайлСсылка - справочник ККСНГ_ПрисоединенныеФайлы
//
// Возвращаемое значение: 
//	Content - произвольный
//
Функция ПолучитьДвоичныеДанныеФайла(ФайлСсылка) Экспорт
	
	// TODO:
	// Сделать нормальную обработку с проверкой данных 
	// 2019-06-07 Попов Д.В.
	Возврат ФайлСсылка.Content.Получить();
	
КонецФункции

#КонецОбласти

#Область Квитанции

// Записывает квитанцию в ИБ 
//
// Параметры: 
//	СтруктураОбъекта - структура, см. https://confluence.esphere.ru/display/SBER/TicketDetails
//	Владелец - ссылка на владельца ККСНГ_ЭлектронныеДокументы
//
// Возвращаемое значение: 
//	Результат - ссылка, неопределено - ссылка на справочник ККСНГ_Квитанции
//
Функция ЗаписатьКвитанцию(СтруктураОбъекта, Владелец) Экспорт
	
	// Подготовка структуры ответа
	СтруктураОтвета = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись квитанции (" + Формат(СтруктураОбъекта.Id, "ЧГ=") + ")");
	
	// Обработка объекта записи
	ОбъектКвитанция = ПолучитьОбъектКвитанция(СтруктураОбъекта.Id, Владелец);
	
	// Очистка реквизитов и ТЧ
	ОчиститьДанныеОбъекта(ОбъектКвитанция);
	
	// Заполнение свойств + дополнительные поля и ТЧ
	ЗаполнитьЗначенияСвойств(ОбъектКвитанция, СтруктураОбъекта);
	
	ОбъектКвитанция.Владелец = Владелец;
	
	Попытка
		ОбъектКвитанция.ККСНГ_ExtendedDocumentType = Перечисления.ККСНГ_ExtendedDocumentType[СокрЛП(СтруктураОбъекта.ExtendedType)];
	Исключение
		ОбъектКвитанция.ККСНГ_ExtendedDocumentType = Перечисления.ККСНГ_ExtendedDocumentType.ПустаяСсылка();
	КонецПопытки;
	
	///////////////
	// Подписи ТЧ
	ОбъектКвитанция.Подписи.Очистить();
	
	Для Каждого СтруктураПодписи Из СтруктураОбъекта.Signature Цикл
		НоваяПодпись = ОбъектКвитанция.Подписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПодпись, СтруктураПодписи.Content);
		НоваяПодпись.Content = Новый ХранилищеЗначения(СтруктураПодписи.Content, Новый СжатиеДанных(9));
		НоваяПодпись.ДатаПодписи = ЭлектроннаяПодпись.ДатаПодписания(СтруктураПодписи.Content);
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
	
		// Запись и заполнение структуры ответа
		Если ЗаписатьНекийОбъект(ОбъектКвитанция, , СтруктураОтвета.Журнал) Тогда
			СтруктураОтвета.Результат = ОбъектКвитанция.Ссылка;
			СтруктураОтвета.Успех = Истина;
		КонецЕсли;	
		
		ЗафиксироватьТранзакцию();				
		
	Исключение
		ОтменитьТранзакцию();
		СтруктураОтвета.Успех = Ложь;
		ТекстОшибки = "Запись квитанции (" + Формат(СтруктураОбъекта.Id, "ЧГ=") + "): " + ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(СтруктураОтвета.Журнал, ТекстОшибки, "RQ-20004");				
	КонецПопытки;			
		
	Возврат СтруктураОтвета; 
	
КонецФункции

// Получает квитанцию как объект
//
// Параметры:
//	Id - Идентификатор квитанции
//	Владелец - ссылка на владельца ККСНГ_ЭлектронныеДокументы
//
// Возвращаемое значение: 
//	Результат - объект, неопределено - ссылка на справочник ККСНГ_Квитанции
//
Функция ПолучитьОбъектКвитанция(Id, Владелец) Экспорт
	
	ОбъектКвитанция = Неопределено;
	
	СсылкаСуществующего = ПолучитьСсылкуКвитанции(Id, Владелец);
	
	Если СсылкаСуществующего.Пустая() Тогда
		ОбъектКвитанция = Справочники.ККСНГ_Квитанции.СоздатьЭлемент();
	Иначе
		ОбъектКвитанция = СсылкаСуществующего.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ОбъектКвитанция;
	
КонецФункции

// Получает ссылку на квитанцию
//	Id - Идентификатор квитанции
//	Владелец - ссылка на владельца ККСНГ_ЭлектронныеДокументы
//
// Параметры:
//
// Возвращаемое значение: 
//	Результат - ссылка, пустаяссылка - объект справочника ККСНГ_Квитанции
//
Функция ПолучитьСсылкуКвитанции(Id, Владелец) Экспорт
	
	Возврат Справочники.ККСНГ_Квитанции.НайтиПоРеквизиту("Id", Id , , Владелец);
	
КонецФункции

// Получает список квитанций документа
//	Владелец - ссылка на владельца ККСНГ_ЭлектронныеДокументы
//	NeedReply - булево - признак отбора квитанций
//
// Параметры:
//
// Возвращаемое значение: 
//	Результат - массив СправочникСсылка.ККСНГ_Квитанции
//
Функция ПолучитьКвитанцииДокумента(Владелец, NeedReply = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Выборка = Справочники.ККСНГ_Квитанции.Выбрать(, Владелец);
	Пока Выборка.Следующий() Цикл
		Если NeedReply = Неопределено Или Выборка.NeedReply = NeedReply Тогда
			Результат.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЭлектронныеПодписиЭлектронныхДокументов

// Функция - Добавить подписи электронного документа
//
// Параметры:
//  СоответствиеПодписиСертификаты - Соответствие: 
// 		* Ключ 	   - Структура	 - СтруктураПодписи
// 		* Значение - Структура	 - СтруктураДанныхСертификата
//  IdДокумента					   - Число	 - Идентификатор электронного документа
//  ПрофильЭДООрганизации		   - СправочникСсылка.ККСНГ_Организации	 - ссылка на профиль ЭДО организации
// 
// Возвращаемое значение:
//	Результат - Структура, с полями 
//			Успех - Булево - Результат выполнения операции
//			Результат - СправочникСсылка.ККСНГ_ЭлектронныеДокументы, Неопределено - ссылка на справочник ККСНГ_ЭлектронныеДокументы  
//			Журнал -
//
Функция ДобавитьПодписиЭлектронногоДокумента(СоответствиеПодписиСертификаты, IdДокумента, ПрофильЭДООрганизации) Экспорт
	
	// Подготовка структуры ответа
	СтруктураОтвета = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись подписей ЭД (" + Формат(IdДокумента, "ЧГ=") + ")");
	
	// Обработка объекта записи
	ОбъектЭД = ПолучитьОбъектЭД(IdДокумента, ПрофильЭДООрганизации);
	
	ТабличнаяЧастьПодписи = ОбъектЭД.DocumentSigns;
	
	Для каждого СоответствиеПодписьСертификат Из СоответствиеПодписиСертификаты Цикл
		
		СтруктураПодписи = СоответствиеПодписьСертификат.Ключ;
		ДанныеСертификата = СоответствиеПодписьСертификат.Значение;		
		
		НоваяСтрокаТабличнойЧасти = ТабличнаяЧастьПодписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтруктураПодписи);
		
		СертификатСсылка = ПолучитьСсылкуСертификат(ДанныеСертификата.Thumbprint);
		Если СертификатСсылка.Пустая() Тогда
			РезультатЗаписиСертификата = ЗаписатьСертификат(ДанныеСертификата);
			Если РезультатЗаписиСертификата.Успех Тогда
				СертификатСсылка = РезультатЗаписиСертификата.Результат;
			Иначе
				Возврат СтруктураОтвета;
			КонецЕсли;
		КонецЕсли; 
		
		НоваяСтрокаТабличнойЧасти.Image = Новый ХранилищеЗначения(СтруктураПодписи.Image, Новый СжатиеДанных(9));
		
		НоваяСтрокаТабличнойЧасти.Сертификат = СертификатСсылка;
		
	КонецЦикла;
	
	// Запись и заполнение структуры ответа
	Если ЗаписатьНекийОбъект(ОбъектЭД, , СтруктураОтвета.Журнал) Тогда
		СтруктураОтвета.Результат = ОбъектЭД.Ссылка;
		СтруктураОтвета.Успех = Истина;
	КонецЕсли;	
	
	Возврат СтруктураОтвета;
	
КонецФункции 

#КонецОбласти

#Область СертифкатыКлючейЭлектроннойПодписи

// Записывает данные сертификата в объект ИБ
// 
// Параметры:
//  СтруктураОбъекта - структура, см. https://confluence.esphere.ru/display/SBER/Document
//
// Возвращаемое значение: 
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ЗаписатьСертификат(СтруктураОбъекта) Экспорт
	
	//Подготовка структуры ответа
	СтруктураОтвета = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись Сертификата (" + СтруктураОбъекта.Thumbprint + ")");
	
	//Обработка объекта записи
	ОбъектСертификат = ПолучитьОбъектСертификат(СтруктураОбъекта.Thumbprint);
	
	//Очистка реквизитов и ТЧ
	ОчиститьДанныеОбъекта(ОбъектСертификат);
	
	//Заполнение свойств + дополнительные поля и ТЧ
	ЗаполнитьЗначенияСвойств(ОбъектСертификат, СтруктураОбъекта);
	
	ОбъектСертификат.Код = СтруктураОбъекта.Thumbprint;
	
	СтруктураСубъекта = СтруктураОбъекта.Person;
	
	MiddleName = "";
	
	Если СтруктураСубъекта.Свойство("MiddleName")
		И ЗначениеЗаполнено(СтруктураСубъекта.MiddleName) Тогда
		MiddleName = " " + СтруктураСубъекта.MiddleName;	
	КонецЕсли;
	
	ОбъектСертификат.Подписант = СтруктураСубъекта.LastName + " " + СтруктураСубъекта.FirstName + MiddleName;
	
	ОбъектСертификат.Image = Новый ХранилищеЗначения(СтруктураОбъекта.Image, Новый СжатиеДанных(9));
	
	//Запись и заполнение структуры ответа
	Если ЗаписатьНекийОбъект(ОбъектСертификат,,СтруктураОтвета.Журнал) Тогда
		СтруктураОтвета.Результат = ОбъектСертификат.Ссылка;
		СтруктураОтвета.Успех = Истина;
	КонецЕсли;	
	
	Возврат СтруктураОтвета; 	
	
КонецФункции

// Получает новый или существующий объект ИБ по отпечатку
// 
// Параметры:
//  ОтпечатокСертификата - Строка
//
// Возвращаемое значение: 
//  Объект Справочник.ККСНГ_СертификатыКлючейЭлектроннойПодписи
//
Функция ПолучитьОбъектСертификат(ОтпечатокСертификата) Экспорт
	
	ОбъектСертификат = Неопределено;
	
	СсылкаСуществующего = ПолучитьСсылкуСертификат(ОтпечатокСертификата);
	
	Если СсылкаСуществующего.Пустая() Тогда
		ОбъектСертификат = Справочники.ККСНГ_СертификатыКлючейЭлектроннойПодписи.СоздатьЭлемент();
	Иначе
		ОбъектСертификат = СсылкаСуществующего.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ОбъектСертификат;
	
КонецФункции

// Получает ссылку объекта ИБ по отпечатку
// 
// Параметры:
//  ОтпечатокСертификата - Строка
//
// Возвращаемое значение: 
//  Ссылка на Справочник.ККСНГ_СертификатыКлючейЭлектроннойПодписи или Неопределено
//
Функция ПолучитьСсылкуСертификат(ОтпечатокСертификата) Экспорт
	
	Возврат Справочники.ККСНГ_СертификатыКлючейЭлектроннойПодписи.НайтиПоКоду(ОтпечатокСертификата); 
	
КонецФункции

#КонецОбласти 

#Область СертификатыКлючейЭлектроннойПодписиИШифрования

// Получает отпечаток активного зарегистрированного сертификата авторизованного пользователя.
// См. ККСНГ_APIКурьер.v1_DictionaryUserCertificate
//
// Параметры:
//	ИскомыйОтпечаток  - Cтрока base64 - содержит двоиные данные отпечатка
//
// Возвращаемое значение: 
//	СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - если сертификат найден;
//  Неопределено - если сертификат не найден.
//
Функция ПолучитьСертификатКлючаЭППоОтпечатку(ИскомыйОтпечаток) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка КАК НайденныйСертификат
		|ИЗ
		|	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
		|ГДЕ
		|	НЕ СертификатыКлючейЭлектроннойПодписиИШифрования.ПометкаУдаления
		|	И СертификатыКлючейЭлектроннойПодписиИШифрования.Отпечаток = &ИскомыйОтпечаток";
	
	Запрос.УстановитьПараметр("ИскомыйОтпечаток", ИскомыйОтпечаток);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.НайденныйСертификат;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Запись объекта ИБ с добавлением информации в журнал сообщений
//
// Параметры:
//  НекийОбъект    - Произвольный
//  ПараметрЗаписи - Структура - параметры записи объекта ИБ
//  Журнал         - Массив - журнал сообщений
//
// Возвращаемое значение: 
//  Булево
//
Функция ЗаписатьНекийОбъект(НекийОбъект, ПараметрЗаписи = Неопределено, Журнал = Неопределено) Экспорт
	
	МетаданныеСиноним = НекийОбъект.Метаданные().Синоним;
	
	Результат = Истина;
	
	Попытка
		
		Если ПараметрЗаписи = Неопределено Тогда
			НекийОбъект.Записать();
		Иначе
			НекийОбъект.Записать(ПараметрЗаписи);
		КонецЕсли;
		
	Исключение
		Ошибка = ОписаниеОшибки();
		Результат = Ложь;
	КонецПопытки;
	
	Если Журнал = Неопределено И НЕ Результат Тогда
		ВызватьИсключение Ошибка; 
	Иначе
		Если Результат Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Журнал, "Объект "+ Строка(НекийОбъект.Ссылка) + " успешно записан");
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Журнал, "Объект "+ МетаданныеСиноним + " не был записан." + Символы.ПС + Ошибка, "BD-00001");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Очищает РС ККСНГ_ПМ_ДопРеквизитыЭД по документу
//
// Параметры:
//  ДокументСсылка - Ссыылка на документ
//
// Возвращаемое значение: 
//  Ответ, см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ОчиститьДопРеквизитыДокумента(ДокументСсылка) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Очистка доп. реквизитов документа " + ДокументСсылка);

	Попытка 
		МодульМенеджераДопРеквизитыЭД = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("РегистрыСведений.ККСНГ_ПМ_ДопРеквизитыЭД");
		НаборЗаписей = МодульМенеджераДопРеквизитыЭД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СвязанныйДокумент.Установить(ДокументСсылка);
		
		НаборЗаписей.Записать();
		
		Ответ.Успех = Истина;
	Исключение
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки(), "RW-00014");
		
	КонецПопытки;
		
	Возврат Ответ;
	
КонецФункции

#Область ПрофилиОрганизаций

// Получает настройку обмена для организации (Профиль организации) по коду участника ЭДО
// 
// Параметры:
//  КодЭДО - Код участника ЭДО
//
// Возвращаемое значение: 
//  ПрофильОрганизацииСсылка - ссылка, пустая ссылка
//
Функция ПолучитьПрофильЭДООрганизацииПоКодуЭДО(Знач КодЭДО) Экспорт
	
	ПрофильОрганизацииСсылка = Справочники.ККСНГ_Организации.НайтиПоРеквизиту("КодУчастникаЭДО", КодЭДО);	
	
	Возврат ПрофильОрганизацииСсылка;
	
КонецФункции

// Получает настройку обмена для организации (Профиль организации) по документу// 
// Параметры:
//  КодЭДО - Код участника ЭДО
//
// Возвращаемое значение: 
//  ПрофильОрганизацииСсылка - ссылка, пустая ссылка
//
Функция ПолучитьПрофильЭДООрганизацииДокумента(Знач ЭлектронныйДокумент) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ККСНГ_Организации.Ссылка КАК ПрофильОрганизации
		|ИЗ
		|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
		|ГДЕ
		|	НЕ ККСНГ_Организации.ПометкаУдаления
		|	И ККСНГ_Организации.КодУчастникаЭДО = &КодУчастникаЭДО";
	
	Запрос.УстановитьПараметр("КодУчастникаЭДО", ЭлектронныйДокумент.КодЭДОВладельца);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ПрофильОрганизацииСсылка = ВыборкаДетальныеЗаписи.ПрофильОрганизации;
	Иначе 
		ПрофильОрганизацииСсылка = Справочники.ККСНГ_Организации.ПустаяСсылка();
	КонецЕсли;
		
	Возврат ПрофильОрганизацииСсылка;
	
КонецФункции

// Получает настройку обмена для организации (Профиль организации и контрагента) по документу
// Параметры:
//  ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//
// Возвращаемое значение:
//  Структура - ссылки или пустые ссылки на организацию и контрагента
//
Функция ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент) Экспорт
	
	Перем Результат, ТекстЗапроса, Запрос, РезультатЗапроса, Выборка;
	
	Результат = Новый Структура;
	Результат.Вставить("ОрганизацияЭДО", Справочники.ККСНГ_Организации.ПустаяСсылка());
	Результат.Вставить("КонтрагентЭДО", Справочники.ККСНГ_Контрагенты.ПустаяСсылка());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭлектронныеДокументы.ОрганизацияЭДО КАК ОрганизацияЭДО,
	|	ЕСТЬNULL(ККСНГ_Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.ККСНГ_Контрагенты.ПустаяСсылка)) КАК КонтрагентЭДО
	|ИЗ
	|	(ВЫБРАТЬ
	|		ККСНГ_ЭлектронныеДокументы.Ссылка КАК ЭлектронныйДокумент,
	|		ЕСТЬNULL(ККСНГ_Организации.Ссылка, ЗНАЧЕНИЕ(Справочник.ККСНГ_Организации.ПустаяСсылка)) КАК ОрганизацияЭДО,
	|		ВЫБОР
	|			КОГДА ККСНГ_ЭлектронныеДокументы.НаправлениеЭД = ЗНАЧЕНИЕ(Перечисление.ККСНГ_НаправленияЭД.Входящий)
	|				ТОГДА ККСНГ_ЭлектронныеДокументы.SellerCode
	|			ИНАЧЕ ККСНГ_ЭлектронныеДокументы.BuyerCode
	|		КОНЕЦ КАК КодЭДОКонтрагента
	|	ИЗ
	|		Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|			ПО ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца = ККСНГ_Организации.КодУчастникаЭДО
	|				И (НЕ ККСНГ_Организации.ПометкаУдаления)
	|	ГДЕ
	|		ККСНГ_ЭлектронныеДокументы.Ссылка = &ЭлектронныйДокумент) КАК ЭлектронныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ПО ЭлектронныеДокументы.КодЭДОКонтрагента = ККСНГ_Контрагенты.КодУчастникаЭДО
	|			И ЭлектронныеДокументы.ОрганизацияЭДО = ККСНГ_Контрагенты.Владелец";
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.ОрганизацияЭДО = Выборка.ОрганизацияЭДО;
		Результат.КонтрагентЭДО = Выборка.КонтрагентЭДО;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет способ авторизации токеном
//
// Параметры:
//  ПрофильОрганизации - Справочник.ККСНГ_Организации
//
// Возвращаемое значение: 
//  Булево
//
Функция ПрофильИспользуетТокенСбербанка(Знач ПрофильОрганизации) Экспорт
	
	СпособАвторизации = ККСНГ_ДокументооборотВызовСервера.СпособАвторизацииОрганизации(ПрофильОрганизации);
	
	Возврат СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьКлючиСтрокСвязанныхДокументов(ТаблицаЗаписей)
	
	ТаблицаЗаписей.Сортировать("Дата УБЫВ, СвязанныйДокумент УБЫВ");
	Для каждого СтрокаЗаписи Из ТаблицаЗаписей Цикл
		СтрокаЗаписи.КлючСтроки = ТаблицаЗаписей.Индекс(СтрокаЗаписи) + 1;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьДанныеОбъекта(НекийОбъект)
	
	МетаданныеОбъекта = НекийОбъект.Метаданные();
	МетаданныеИмя = МетаданныеОбъекта.Имя;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		
		//У ЭД не очищаем реквизит ДокументОснование
		Если МетаданныеИмя = "ККСНГ_ЭлектронныеДокументы" И Реквизит.Имя = "ДокументОснование" Тогда
			Продолжить;
		КонецЕсли;
		
		НекийОбъект[Реквизит.Имя] = Неопределено; 
		
	КонецЦикла; 
	
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл 
		НекийОбъект[ТабличнаяЧасть.Имя].Очистить(); 
	КонецЦикла; 
	
КонецПроцедуры //ОчиститьДанныеОбъекта

Процедура ИнициализироватьСвойстваЭДПоМаркировке(ОбъектЭД, ЭтоНовыйЭД, ПараметрыАвторизации)

	Если ККСНГ_ЭлектронныеДокументыВызовСервера.ЭтоСтруктурированныйЭД(ОбъектЭД.DocumentTypeCode) И (ЭтоНовыйЭД Или ОбъектЭД.ЕстьМаркировка Или (Не ОбъектЭД.ЕстьМаркировка И ОбъектЭД.СтатусЦРПТ <> -1)) Тогда
		Если Не ОбъектЭД.ЕстьМаркировка Тогда
			ИнициализироватьПризнакМаркировкиПоМаскеФайла(ОбъектЭД, ПараметрыАвторизации);
		КонецЕсли;
		ИнициализироватьДанныеОтЦРПТ(ОбъектЭД, ПараметрыАвторизации);
	КонецЕсли;
	
	Если Не ОбъектЭД.ЕстьМаркировка Тогда
		ОбъектЭД.СтатусЦРПТ = -1;
	КонецЕсли;

КонецПроцедуры

Процедура ИнициализироватьДанныеОтЦРПТ(ОбъектЭД, ПараметрыАвторизации)

	Если ОбъектЭД.ЕстьМаркировка Тогда
		ЗапросСтатусаЦРПТ = ККСНГ_ДокументооборотВызовСервера.СтатусЦРПТДокумента(ОбъектЭД.Id, ПараметрыАвторизации);
		Если ЗапросСтатусаЦРПТ.Успех Тогда
			ОбъектЭД.СтатусЦРПТ = ЗапросСтатусаЦРПТ.Результат;
			
			Если ЗапросСтатусаЦРПТ.ДанныеПоОшибкеОтЦРПТ.Успех Тогда
				ОбъектЭД.ОшибкиЦРПТ = Новый ХранилищеЗначения(ЗапросСтатусаЦРПТ.ДанныеПоОшибкеОтЦРПТ.Результат, Новый СжатиеДанных(9));
				ОбъектЭД.КодОшибкиЦРПТ = ЗапросСтатусаЦРПТ.ДанныеПоОшибкеОтЦРПТ.Результат.КодОшибки;
				ОбъектЭД.ОписаниеОшибкиЦРПТ = ЗапросСтатусаЦРПТ.ДанныеПоОшибкеОтЦРПТ.Результат.ОписаниеОшибки;
			КонецЕсли;
			
		Иначе
			ОбъектЭД.СтатусЦРПТ = 5;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ИнициализироватьПризнакМаркировкиПоМаскеФайла(ОбъектЭД, ПараметрыАвторизации)
	
	Перем МассивПрефиксов, ТекFilename, МассивСтрок, ПризнакМаркировки;
	
	МассивПрефиксов = Новый Массив;
	МассивПрефиксов.Добавить("NSCHFDOPPRMARK");
	МассивПрефиксов.Добавить("NSCHFDOPPOKMARK");
	МассивПрефиксов.Добавить("NKORSCHFDOPPRMARK");
	МассивПрефиксов.Добавить("KORSCHFDOPPR");
	МассивПрефиксов.Добавить("KORSCHFDOPPOK");
	
	ТекFilename = Врег(ОбъектЭД.Filename);
	МассивСтрок = СтрРазделить(ТекFilename, "_");
	
	Если МассивСтрок.Количество() = 12 Тогда
		ПризнакМаркировки = МассивСтрок[7];
		ОбъектЭД.ЕстьМаркировка = ?(ПризнакМаркировки = "1", Истина, Ложь);
	Иначе
		Для каждого Префикс Из МассивПрефиксов Цикл
			Если МассивСтрок.Найти(Префикс) <> Неопределено Тогда
				Если Префикс = "KORSCHFDOPPOK" Или Префикс = "KORSCHFDOPPR" Тогда
					ЗапросНаличияМаркировки = ККСНГ_ЭлектронныеДокументыВызовСервера.ПолучитьДополнительноеСвойствоДокумента(ПараметрыАвторизации, ОбъектЭД.Id, "contains.markedgoods", Тип("Булево"));
					ОбъектЭД.ЕстьМаркировка = ЗапросНаличияМаркировки.Успех И ЗапросНаличияМаркировки.Результат;
				Иначе
					ОбъектЭД.ЕстьМаркировка = Истина;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
